Revit 2026 API

# ColorFillSchemeAreEntriesConsistentWithScheme Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public EntryAndSchemeConsistency AreEntriesConsistentWithScheme(
	IList<ColorFillSchemeEntry> entries
)
```
```vb
Public Function AreEntriesConsistentWithScheme (
	entries As IList(Of ColorFillSchemeEntry)
) As EntryAndSchemeConsistency
```
```cpp
public:
EntryAndSchemeConsistency AreEntriesConsistentWithScheme(
	IList<ColorFillSchemeEntry^>^ entries
)
```
```fsharp
member AreEntriesConsistentWithScheme :
        entries : IList<ColorFillSchemeEntry> -> EntryAndSchemeConsistency
```

#### Parameters

entries IListColorFillSchemeEntry

#### Return Value

EntryAndSchemeConsistency

#### Reference

ColorFillScheme Class

Autodesk.Revit.DB Namespace